Revit 2027 API
BuiltInFailures.ElevationFailures.ElevationDetach Property
 An Elevation arrow can't keep its Crop Region extents attached.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElevationDetach { get; }
Public Shared ReadOnly Property ElevationDetach As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElevationDetach {
	FailureDefinitionId^ get ();
}
static member ElevationDetach : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.ElevationFailures Class
Autodesk.Revit.DB Namespace